{
  "theory_block": {
    "id": "b2_theory_permanent_vs_temporary",
    "concept_id": "simple_permanent_vs_continuous_temporary",
    "content_md": "**Второе правило связано с различием между постоянными и временными ситуациями.**\n\n**Present Simple** описывает **постоянные ситуации**, которые остаются неизменными длительное время или являются частью привычного образа жизни. Это стабильные обстоятельства.\n\n**Present Continuous** описывает **временные ситуации**, которые продолжаются ограниченный период времени и могут измениться. Это изменяющиеся обстоятельства.",
    "key_points": [
      "Simple = постоянная ситуация (I live in Moscow)",
      "Continuous = временная ситуация (I'm living in a hotel this week)",
      "Постоянное предполагает стабильность, временное — ограниченный срок"
    ],
    "common_mistakes": [
      {
        "wrong": "I'm living in Moscow. (когда речь о постоянном месте жительства)",
        "right": "I live in Moscow.",
        "why": "Если место жительства постоянное, используется Present Simple, а не Continuous"
      },
      {
        "wrong": "I work in London this month. (когда речь о временной работе)",
        "right": "I'm working in London this month.",
        "why": "Временная ситуация требует Present Continuous, особенно с маркерами типа 'this month'"
      }
    ],
    "examples": [
      {
        "id": "ex1",
        "text": "I live in Moscow. It's my permanent address.",
        "translation": "Я живу в Москве. Это мой постоянный адрес.",
        "notes": "Постоянная ситуация — Present Simple",
        "tags": ["affirmative", "permanent"]
      },
      {
        "id": "ex2",
        "text": "I'm living in a hotel this week while my apartment is being renovated.",
        "translation": "Я живу в отеле на этой неделе, пока ремонтируют мою квартиру.",
        "notes": "Временная ситуация — Present Continuous",
        "tags": ["affirmative", "temporary"]
      },
      {
        "id": "ex3",
        "text": "She works for a big company, but she's working from home this month.",
        "translation": "Она работает в большой компании, но этот месяц работает из дома.",
        "notes": "Постоянная работа (Simple) и временная ситуация (Continuous)",
        "tags": ["affirmative"]
      }
    ]
  }
}
