{
  "theory_block": {
    "id": "b3_theory_state_vs_action_verbs",
    "concept_id": "state_verbs_simple_action_verbs_continuous",
    "content_md": "**Третье правило связано с типом глагола: статичные (state verbs) или динамичные (action verbs).**\n\n**Статичные глаголы** (state verbs) описывают **состояния**, **чувства**, **мысли**, **ощущения** и **отношения**. Они обычно не используются в Continuous формах, потому что состояния не являются «процессами» или «действиями в процессе». Примеры: know, like, believe, want, need, understand.\n\n**Динамичные глаголы** (action verbs) описывают **конкретные действия**, которые можно наблюдать и которые имеют начало и конец. Эти глаголы могут использоваться как в Simple, так и в Continuous, в зависимости от значения.",
    "key_points": [
      "Статичные глаголы (know, like, want) обычно только в Simple",
      "Динамичные глаголы (run, write, talk) могут быть в Continuous",
      "Состояния не являются процессами, поэтому они не используют Continuous"
    ],
    "common_mistakes": [
      {
        "wrong": "I'm knowing English well. (неправильно для статичного глагола)",
        "right": "I know English well.",
        "why": "Глагол 'know' — статичный, описывает состояние, не используется в Continuous"
      },
      {
        "wrong": "I'm liking this song. (неправильно для статичного глагола)",
        "right": "I like this song.",
        "why": "Глагол 'like' — статичный, описывает отношение, не используется в Continuous"
      }
    ],
    "examples": [
      {
        "id": "ex1",
        "text": "I know this answer. I understand the problem.",
        "translation": "Я знаю этот ответ. Я понимаю проблему.",
        "notes": "Статичные глаголы know и understand — только Present Simple",
        "tags": ["affirmative", "state_verb"]
      },
      {
        "id": "ex2",
        "text": "I'm running in the park. I'm writing a letter.",
        "translation": "Я бегаю в парке. Я пишу письмо.",
        "notes": "Динамичные глаголы могут быть в Present Continuous",
        "tags": ["affirmative", "action_verb"]
      },
      {
        "id": "ex3",
        "text": "She wants coffee, but she's making tea right now.",
        "translation": "Она хочет кофе, но сейчас готовит чай.",
        "notes": "Статичный глагол want (Simple) и динамичный глагол make (Continuous)",
        "tags": ["affirmative"]
      }
    ]
  }
}
