{
  "theory_block": {
    "id": "b5_theory_temporary_vs_permanent",
    "concept_id": "present_continuous_temporary_vs_permanent",
    "content_md": "**Ключевое различие между Present Continuous и Present Simple — это временность vs постоянность ситуации.**\n\nPresent Continuous описывает временные ситуации, действия или состояния, которые характерны для определенного периода времени, но не являются постоянными. Present Simple описывает постоянные факты, привычки или общие истины, которые не меняются со временем.\n\nЭто различие критически важно для правильного выбора времени. Одна и та же ситуация может описываться по-разному в зависимости от того, является ли она временной или постоянной.",
    "key_points": [
      "Present Continuous = временная ситуация",
      "Present Simple = постоянный факт или привычка",
      "Одна и та же ситуация может быть временной или постоянной"
    ],
    "common_mistakes": [
      {
        "wrong": "I'm living in Moscow. (постоянное место жительства)",
        "right": "I live in Moscow.",
        "why": "Постоянное место жительства описывается Present Simple, а не Continuous"
      },
      {
        "wrong": "She works as a teacher this semester. (временная работа)",
        "right": "She's working as a teacher this semester.",
        "why": "Временная работа требует Present Continuous, так как это временная ситуация"
      }
    ],
    "examples": [
      {
        "id": "ex1",
        "text": "I live in Paris. (permanent) vs I'm living in Paris this year. (temporary)",
        "translation": "Я живу в Париже. (постоянно) vs Я живу в Париже в этом году. (временно)",
        "notes": "Сравнение постоянной и временной ситуации",
        "tags": ["comparison", "permanent", "temporary"]
      },
      {
        "id": "ex2",
        "text": "She works at a bank. (permanent job) vs She's working at a bank this month. (temporary job)",
        "translation": "Она работает в банке. (постоянная работа) vs Она работает в банке в этом месяце. (временная работа)",
        "notes": "Сравнение постоянной и временной работы",
        "tags": ["comparison", "permanent", "temporary"]
      }
    ]
  }
}
